app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT `messages`.* FROM `messages`

  def create
    @message = Message.new(params[:message])
    if @message.save
---
INSERT INTO `messages` (`created_at`, `name`, `number`, `updated_at`) VALUES ('2013-05-27 12:30:25', 'faisal', 3324167729, '2013-05-27 12:30:25')

   def destroy
     @message = Message.find(params[:id])
     @message.destroy
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1
DELETE FROM `messages` WHERE `messages`.`id` = 1

  def sms_database
    require 'nexmo'
    # key = c6ec048a
    #secret = c86f0b89
    nexmo = Nexmo::Client.new('0c6ad999', 'abdd4626')
      @messages = Message.all
---
SELECT `messages`.* FROM `messages`

  def add_receiver
    @message = Message.new(params[:message])
    if @message.save
---
INSERT INTO `messages` (`created_at`, `name`, `number`, `updated_at`) VALUES ('2013-05-27 14:53:03', 'adil', '232', '2013-05-27 14:53:03')